Map<String, String> km = {
  'Taing ChingSong': 'តាំង​ ជីងសុង',
  'home': 'ទំព័រដើម',
  'works': 'ការងារ',
  'about-me': 'អំពីខ្ញុំ',
  'contacts': 'ទាក់ទង',
  'ChingSong is a ': 'ជីងសុង ជា ',
  'front-end': 'អ្នកអភិវឌ្ឍខាងមុខ',
  ' and ': ' និង ',
  'cross-platform developer.': 'អ្នកអភិវឌ្ឍកម្មវិធីសម្រាប់វេទិការជាច្រើន។',
  'I craft seamless experiences across devices, blending design and logic to bring ideas to life—one pixel and line of code at a time.':
      'ខ្ញុំបង្កើតបទពិសោធន៍រលូនលើឧបករណ៍ផ្សេងៗ ដោយបញ្ចូលរចនាប័ទ្ម និងតុល្យភាពនៃហេតុការណ៍ ដើម្បីបំប្លែងគំនិតឱ្យក្លាយជាការពិត—រៀងរាល់ភីកសែល និងបន្ទាត់កូដ។',
  'Contact me!!': 'ទំនាក់ទំនងខ្ញុំ!!',
  'Currently working on ': 'កំពុងធ្វើការលើ ',
  'Portfolio': 'ប្រវត្តិការងារ',
  'View all ~~>': 'មើលទាំងអស់ ~~>',
  'Coding is 10% writing code and 90% figuring out why it doesn’t work.':
      'ការសរសេរកូដគឺ ១០% សរសេរកូដ និង ៩០% គឺស្វែងរកថាហេតុអ្វីវាមិនដំណើរការ។',
  'projects': 'គម្រោង',
  'skills': 'ជំនាញ',
  'Language': 'ភាសា',
  'Database': 'មូលដ្ឋានទិន្នន័យ',
  'Tool': 'ឧបករណ៍',
  'Other': 'ផ្សេងៗ',
  'Read more ~~>': 'អានបន្ថែម ~~>',
  'Message me here': 'សូមផ្ញើសារមកខ្ញុំទីនេះ',
  'Media': 'បណ្ដាញសង្គម',
  'Front-end and cross-platform developer.':
      'អ្នកអភិវឌ្ឍមុខងារ និងកម្មវិធីសម្រាប់វេទិកាជាច្រើន។',
  '© Copyright {year}. Made by ChingSong': '@ រក្សាសិទ្ធិ {year}។ បង្កើតដោយ ជីងសុង',
  'Hello, I\'m ChingSong': 'សួស្តី ខ្ញុំគឺជា ជីងសុង',
  'I’m a Flutter mobile developer with a strong passion for building modern, user-friendly apps. I have experience creating real-world projects using Flutter, Dart, GetX, and Figma, and I enjoy turning ideas into clean, functional mobile applications.':
      'ខ្ញុំជាអ្នកអភិវឌ្ឍកម្មវិធីទូរស័ព្ទដោយប្រើ Flutter ដែលមានចំណង់ចំណូលចិត្តខ្លាំងក្នុងការបង្កើតកម្មវិធីទំនើប និងងាយស្រួលប្រើ។ ខ្ញុំមានបទពិសោធន៍ក្នុងការបង្កើតគម្រោងជាក់ស្តែង ដោយប្រើ Flutter, Dart, GetX និង Figma ហើយខ្ញុំចូលចិត្តបំលែងគំនិតឱ្យក្លាយជាកម្មវិធីមួយដែលស្អាត និងដំណើរការបានល្អ។',
  'My focus is on writing maintainable, scalable code and delivering responsive apps that provide smooth user experiences across both Android and iOS platforms. Whether it’s building from scratch or improving existing apps, I thrive in transforming complex problems into intuitive interfaces.':
      'ចំណាប់អារម្មណ៍របស់ខ្ញុំគឺក្នុងការសរសេរកូដដែលងាយស្រួលថែទាំ អាចពង្រីក និងផ្តល់នូវកម្មវិធីដែលបត់បែនបានល្អ ហើយផ្តល់បទពិសោធន៍ប្រើប្រាស់រលូនទាំងលើ Android, iOS និងវេទិការផ្សេងទៀត។ មិនថាជាការសរសេរកម្មវិធីថ្មីពីដំបូង ឬធ្វើឱ្យកម្មវិធីចាស់ប្រសើរឡើង ខ្ញុំរីករាយក្នុងការបំលែងបញ្ហាស្មុគស្មាញឱ្យក្លាយជាចំណុចប្រើប្រាស់ងាយស្រួល។',
  'Hi, I\'m a Flutter mobile developer passionate about building clean and user-friendly apps. If you\'re looking for someone to bring your ideas to life with Flutter, feel free to reach out — I\'d love to connect!':
      'សួស្តី ខ្ញុំជាអ្នកអភិវឌ្ឍកម្មវិធីទូរស័ព្ទដោយប្រើ Flutter ដែលមានចំណង់ចំណូលចិត្តក្នុងការបង្កើតកម្មវិធីស្អាត និងងាយស្រួលប្រើ។ ប្រសិនបើអ្នកកំពុងស្វែងរកនរណាម្នាក់ដើម្បីនាំគំនិតរបស់អ្នកឱ្យក្លាយជាការពិតជាមួយ Flutter សូមកុំស្ទាក់ស្ទើរ ទំនាក់ទំនងមកខ្ញុំ ខ្ញុំរីករាយណាស់ក្នុងការតភ្ជាប់ជាមួយអ្នក!',
  'List of my projects': 'បញ្ជីគម្រោងរបស់ខ្ញុំ',
  'completed-projects': 'គម្រោងដែលបានបញ្ចប់',
  'on-going': 'កំពុងដំណើរការ',
  'EN': 'អង់គ្លេស',
  'KM': 'ខ្មែរ',
  'Who am i?': 'ខ្ញុំជានរណា?',
  'State Management': 'ការគ្រប់គ្រង',
  'my-fun-facts': 'វឿនពិតរបស់ខ្ញុំ',
  'Contact whenever': 'ទំនាក់ទំនងពេលណាក៏បាន',
  'Name': 'ឈ្មោះ',
  'Email': 'អ៊ីមែល',
  'Title': 'ចំណងជើង',
  'Message': 'សាររបស់អ្នក',
  'Send': 'ផ្ញើ',
  'contact-now': 'ទំនាក់ទំនងឥឡូវនេះ',
  'Sometimes, my best ideas come while showering, not coding.':
      'ពេលខ្លះគំនិតល្អបំផុតរបស់ខ្ញុំកើតឡើងនៅពេលមុចទឹក មិនមែនពេលកំពុងសរសេរកូដទេ។',
  'I’ve designed UIs that looked better than the actual product 😅':
      'ខ្ញុំធ្លាប់រចនាផ្ទាំង UI ដែលមើលទៅស្អាតជាងផលិតផលពិតប្រាកដ 😅',
  'I listen to random music while coding — it’s a vibe.':
      'ខ្ញុំស្ដាប់តន្ត្រីចៃដន្យខណៈពេលសរសេរកូដ — វាជារម្មណ៍មួយ។',
  'My app crashes only when someone is watching me demo it.':
      'កម្មវិធីខ្ញុំរលត់ នៅពេលមាននរណាម្នាក់កំពុងមើលខ្ញុំបង្ហាញវា។',
};
